# Матрици

## Въпроси
- Как се достъпват елементите по главния и второстепенния диагонал?
- Как се представя матрица в паметта и как работи индексирането?
- Ако имам елемент на позиция arr[i][j] как да достъпя елемента над/под/преди/след/по четирите диагонала?

## За в час

**Задача 1:** Да се напише функция, която приема квадратна матрица с **n** на **n** елемента отпечатва главния диагонал, след това и второстепенния.

**Пример:**

Вход:
```c++
1 2 3
4 5 6
7 8 9
```
Изход:
```c++
1 5 9
3 5 7
```

**Задача 2:** Да се напише функция, която приема квадратна матрица с **n** на **n** елемента и връща дали матрицата е триъгълна, т.е. под главния диагонал има само нули.

**Пример:**

Вход:
```c++
5 1 5 
0 5 9
0 6 7
```
Изход:
```c++
0
```

Вход:
```c++
5 1 5 
0 5 9
0 0 7
```
Изход:
```c++
1
```
**Задача 3:** Да се напише функция, която транспонира квадратна матрица с **n** на **n** елемента.

**Пример:**

Вход:
```c++
1 2 3 
4 5 6 
7 8 9
```
Изход:
```c++
1 4 7
2 5 8
3 6 9
```

**Задача 4:** Една квадратна матрица от числа се нарича магически квадрат, когато всички суми, получени поотделно от сбора на елементите по всеки ред/всеки стълб/всеки от двата диагонала са равни. Да се състави функция, която приема квадратна матрица и определя дали образува магически квадрат. 

**Пример:**
```c++
16 3 2 13
5 10 11 8
9 6 7 12
4 15 14 1
```
```c++
1 //sum = 34
```

**Задача 5:** Да се напише функция, която приема матрица и принтира елементите й спираловидно, отвън навътре.

**Пример:**
```c++
1 2 3 
4 5 6
7 8 9
```
```c++
1 2 3 6 9 8 7 4 5
```

**Задача 6:** Да се напише функция, която приема матрица и я обръща надясно.

**Пример:**
```c++
1 2 3 
4 5 6
7 8 9
```
```c++
7 4 1
8 5 2
9 6 3
```


**Задача 7:** Напишете функция, която приема правоъгълна матрица от цели числа и определя колко локални максимума съдържа тя.
Един елемент е локален максимум, ако е строго по-голям от всички свои съседи (до 8 на брой — хоризонтални, вертикални и диагонални).

**Пример:**
```c++
1 3 8
4 2 5
7 6 9
```
```c++
3 // 9 8 и 7
```

## За домашна

**Задача 8:** Да се напише функция, която умножава 2 матрици.

**Пример:**
```c++
1 2
8 9
10 0
1 0
2 2

1 2 3 
4 5 2
```
```c++
9 12 7
44 61 42
10 20 30
1 2 3
10 14 10
```


**Задача 9:** Напишете функция, която приема правоъгълна матрица от цели числа и определя колко от редовете ѝ са сортирани в строго нарастващ ред.

**Пример:**
```c++
1 2 3 5
4 4 6 7
0 1 9 10
8 3 2 1
```
```c++
2
```



**Задача 10:** Дадена е правоъгълна матрица A с размери M × N, съставена от цели числа. Дадени са две положителни цели числа r и c (броя редове и броя колони на търсената подматрица).
Да се намери най-голямата възможна сума на елементите на подматрица с размери r×c.

Ограничения: [2 <= N, M <= 50, 1 <= r <= N, 1 <= c <= M]

**Пример:**

```c++
5 6 //M N
3 2 // r c

 1   2  -1   4  5  0
 3   5   6  -2  1  2
-1   4   9   3  7  1
 2   8  -3   6  0  4
 0   1   5   2  9 -2
```

```c++
29
// 5   6
// 4   9
// 8  -3
```

**Задача 11:** Да се напише функция, която приема правоъгълна матрица от цели числа и определя колко седлови точки съдържа тя.
Елемент A[i][j] е седлова точка, ако едновременно:
- е най-малкият елемент в своя ред и е най-големият елемент в своята колона
или обратното:
- е най-големият елемент в своя ред и е най-малкият елемент в своята колона

**Пример:**

```c++
1 2 3
4 5 6
7 8 9
```

```c++
2  // A[0][2]  A[2][0]
```

```c++
3 1 5
7 4 2
6 8 9
```

```c++
0
```
**Задача 12:** Да се напише функция, която приема символен низ с максимална дължина 2048 и матрица от символи. Нека в редовете на матрицата да се запазят всички думи от низа. 
- Всяка дума няма да надвишава 128 символа;
- Гарантирано е, че има най-много 16 думи;
- Гарантирано е, че всички думи са разделени с произволен брой интервали;

**Пример:**

```c++
"How are you today"
```

```c++
["How"]
["are"]
["you"]
["today"]
```


## Проект: Мinesweeper

Да се реализира в **конзолна** играта  **Мinesweeper**.
Целта на играта е да се разкрият всички квадратчета, които не съдържат мини , без да щракнем върху мина преди това. Разположението на мините може да се разбере логически, с помощта на цифрички, стоящи се на местата на квадратчетата след щракане върху тях. Цифрите показват колко квадратчета, в които има мини, има в съседство. Ако се щракне върху квадратче, което няма мини (стои числото 0)  в съседство, то разкрива съседните, ако някое от тези разкрити също няма мини в съседство, то също разкрива съседните квадратчета и тн...

![enter image description here](https://i.ibb.co/F4YY0ST/beginner.png)

[Онлайн версия на играта](http://minesweeperonline.com/#)


**Забележка: От вас не се изисква създаването на графичен интерфейс. Играта трябва да бъде конзолна апликация.**

В конзолата трябва да изпълнявате команди от вида:

> [command] [x coordinate] [y coordinate]

Където [command] е **open**, **mark** или **unmark**, а след него стоят координатите на квадратчето.

 - **open** - отваря квадратчето. Ако там седи мина - край на играта!
 - **mark** - маркира квадратчето като "мина". Ако всички мини са маркирани
   и всички други квардратчета са отворени, играта прилкючва с успех!
 - **unmark** - отмаркира квадрачето като "мина". Ако квадратчето не е било
   маркирано, то се извежда подходящо съобщение за грешка.

При започването на играта, потребителят трябва да може да избере на каква размерност да играе (3 <= N <= 10). След това трябва да избере колко мини да бъдат "скрити".
Броят трябва да е в интервала [1, 3N]. Ако някои от стойностите не са въведат правилно от потребителя, то трябва да се изведе подходящо съобщение и да бъде "приканен" да въведе отново.
